app/views/movies/index.html.haml

        %th{class: 'hilite'}
          =link_to 'Movie Title', {controller: ['movies'], action: ['index'], sort_title: '1'}.merge(params.select{|k,v| k != 'sort_release_date'}), id: 'title_header'
---
SELECT "movies".* FROM "movies" WHERE "rating"."R" = '1'