app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (("movies"."rating" IN ('G', 'R', 'PG-13', 'PG') OR "movies"."rating" IS NULL)) ORDER BY title
---
  def index
    # Manejo de parametros

    path = {controller: 'movies', action: 'index'}
    redirect = false

    if !params[:sort_title].nil?
      session[:sort_title] = params[:sort_title]
      session[:sort_release_date] = nil
    elsif !params[:sort_release_date].nil?
      session[:sort_title] = nil
      session[:sort_release_date] = params[:sort_release_date]
    end

    sort_title = session[:sort_title] unless session[:sort_title].nil?
    sort_release_date = session[:sort_release_date] unless session[:sort_release_date].nil?

    if params[:ratings].nil? && session[:ratings].nil?
      @ratings = {}
      Movie.get_ratings.sort.each {|t| @ratings[t] = '1'}

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') AND "movies"."order" = 'release_date'
---
      @movies = Movie.where(rating: @ratings.keys).order("title")
      @sort_title = 1
    elsif sort_release_date == '1'
      @movies = Movie.where(rating: @ratings.keys).order("release_date")